2.2.013/src/Catalogs/МК_ЗаявленияСотрудников/МК_ЗаявленияСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МК_ЗаявленияСотрудников</name>
  <attributes>
    <name>МК_ВидЗаявления</name>
    <type>
      <types>CatalogRef.МК_НастройкиСвязиЗаявленийКЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗаявления</name>
    <type>
      <types>EnumRef.МК_СтатусыЗаявлений</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МК_ПутьКФайлу</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекущийПодписант</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Роль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипПодписи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусПодписанияОчередногоУчастника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МК_КодЗаявления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Документ1С</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>МК_КодЗаявкиНаОтсутствие</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипДокумента1С</name>
    <type>
      <types>EnumRef.МК_ОбрабатываемыеВидыДокументовПоЗаявлениям</types>
      <types>CatalogRef.ВидыОтпусков</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДокумента1С</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокументаМК</name>
    <type>
      <types>CatalogRef.МК_ВидыДокументовМояКоманда</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Подписанты</name>
    <attributes>
      <name>Номер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тип</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипПодписи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СоставРоли</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекущийПодписант</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоставРоли</name>
    <attributes>
      <name>Номер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подписант</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

2.2.013/src/Catalogs/МК_ЗаявленияСотрудников/Forms/ФормаСписка/Module.bsl
&НаСервере
Функция ОбновитьНаСервере()
	// Надо получить список заявлений.
	мРез = Справочники.МК_ЗаявленияСотрудников.ПолучитьИОбработатьЗаявленияИзМК();
	Возврат мРез;
КонецФункции

&НаКлиенте
Процедура Обновить(Команда)
	мРез = ОбновитьНаСервере(); 
	Если мРез.Результат Тогда
		Элементы.Список.Обновить();  
	Иначе	
		ПоказатьПредупреждение(,"Операция не удалась: " + мРез.ТекстОшибки);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Согласовать(Команда)
	ИсполнитьОтклонить(1);	
КонецПроцедуры

&НаКлиенте
Процедура Отклонить(Команда)
	ИсполнитьОтклонить(2); 
КонецПроцедуры  

&НаКлиенте
Процедура ИсполнитьОтклонить(мРежим) 
	//Здесь остановился!
	// Надо определить - действительно этот пользователь должен что-то сделать?
	мПользователь = ЭтаФорма.Пользователь;  
	мЗ = Элементы.Список.ТекущаяСтрока;	
	
	мРез = ИсполнитьОтклонитьСервер(мРежим, мПользователь, мЗ);  
	ОповеститьОбИзменении(мЗ);
	//Элементы.Подписанты.Обновить();
	//ЭтаФорма.ОбновитьОтображениеДанных(); 
	Если Не мРез.Результат Тогда             
		ПоказатьПредупреждение(,"Операция не удалась: " + мРез.ТекстОшибки);
	КонецЕсли;	
КонецПроцедуры

Функция ИсполнитьОтклонитьСервер(мРежим, мПользователь, мЗ)     
	мНашел = Ложь;   
	мРез = Новый Структура("Результат,ТекстОшибки", Ложь, "Не ваша очередь для действий");
	мТЗ = мЗ.СоставРоли;
	Для Каждого мСтр Из мТЗ Цикл
		Если мСтр.Подписант = мПользователь Тогда
			мНомерУчастника = мСтр.Номер;
			мНашел = Истина;
			Прервать;
		КонецЕсли;	
	КонецЦикла;	     
	Если мНашел Тогда
		мМК_КодЗаявления = мЗ.МК_КодЗаявления;
		мДокумент1С = мЗ.Документ1С;    
		мРез = Справочники.МК_ЗаявленияСотрудников.ИсполнитьОтклонитьНаСервере(мРежим, мПользователь, мМК_КодЗаявления, мНомерУчастника, мДокумент1С);   
		Если мРез.Результат Тогда
			мЭлемент = мРез.Подписанты;
			мСтрока = Новый Структура("СтатусЗаявления, Подписанты");
	
			мСтрока.СтатусЗаявления = Справочники.МК_ЗаявленияСотрудников.ПолучитьСтатусЗаявления(мЭлемент.status); 
	
			мСписок = мЭлемент.approvals;
			мСтрока.Подписанты = Новый Массив;
			Для Каждого мПодписант Из мСписок Цикл
				мНовый = Новый Структура("Номер, Имя, Тип, ТипПодписи, СоставРоли, Статус, ТекущийПодписант, МассивИмен");
				мНовый.Номер = мПодписант.id;
				мНовый.Имя = мПодписант.name;
				мНовый.Тип = мПодписант.type;
				мНовый.ТипПодписи = мПодписант.type_signature; 
				мНовый.СоставРоли = мПодписант.user_ids;
				мНовый.Статус = мПодписант.status;    
				мНовый.ТекущийПодписант = мПодписант.pointer;  
				Если мПодписант.Свойство("user_names") Тогда   
					мНовый.МассивИмен = мПодписант.user_names;
				КонецЕсли;	
				мСтрока.Подписанты.Добавить(мНовый);
			КонецЦикла;	                                                     
			мЗаявление = Справочники.МК_ЗаявленияСотрудников.ЗаписатьЗаявление(мСтрока,2,мЗ);  			
		КонецЕсли;		
	КонецЕсли;	
	Возврат мРез;     
КонецФункции  



&НаСервере
Процедура ПрименятьОрганизациюПриИзмененииНаСервере()
	Список.Отбор.Элементы.Очистить();
	мПоказОрг = ЭтаФорма.ПрименятьОрганизацию;		
	мОрг = ЭтаФорма.Организация;
	Если мПоказОрг И ЗначениеЗаполнено(мОрг) Тогда       	
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	    ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Организация");
	    ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	    ЭлементОтбора.Использование = Истина;
	    ЭлементОтбора.ПравоеЗначение = мОрг; 
	КонецЕсли;	
	мПоказСотр = ЭтаФорма.ПрименятьСотрудника;		
	мСотр = ЭтаФорма.Сотрудник;
	Если мПоказСотр И ЗначениеЗаполнено(мСотр) Тогда       	
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	    ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Сотрудник");
	    ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	    ЭлементОтбора.Использование = Истина;
	    ЭлементОтбора.ПравоеЗначение = мСотр; 
	КонецЕсли;  
	мПоказСтатус = ЭтаФорма.ПрименятьСтатусЗаявления;		
	мСтатус = ЭтаФорма.СтатусЗаявления;
	Если мПоказСтатус И ЗначениеЗаполнено(мСтатус) Тогда       	
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	    ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СтатусЗаявления");
	    ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	    ЭлементОтбора.Использование = Истина;
	    ЭлементОтбора.ПравоеЗначение = мСтатус; 
	КонецЕсли;
    мПоказТип = ЭтаФорма.ПрименятьТипДокументаМК;		
	мТип = ЭтаФорма.ТипДокументаМК;
	Если мПоказТип И ЗначениеЗаполнено(мТип) Тогда       	
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	    ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидДокументаМК");
	    ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	    ЭлементОтбора.Использование = Истина;
	    ЭлементОтбора.ПравоеЗначение = мТип; 
	КонецЕсли;   
	мПоказДаты = ЭтаФорма.ПрименятьДату;		
	мДата = ЭтаФорма.ДатаСоздания;
	Если мПоказДаты И ЗначениеЗаполнено(мДата) Тогда       	
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	    ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДатаСоздания");
	    ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	    ЭлементОтбора.Использование = Истина;
	    ЭлементОтбора.ПравоеЗначение = мДата; 
	КонецЕсли; 
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьФильтр(Элемент)
	ПрименятьОрганизациюПриИзмененииНаСервере();
	Элементы.Список.Обновить();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Надо определить текущего пользователя, как физлицо
	мПользователь = Пользователи.ТекущийПользователь().ФизическоеЛицо;  
	Если ЗначениеЗаполнено(мПользователь) Тогда
		ЭтотОбъект.Пользователь = мПользователь;
	Иначе
		Сообщить("Внимание! Не указано физическое лицо в справочнике пользователей ЗУП для текущего пользователя. Активные действия будут невозможны.")
	КонецЕсли;	
КонецПроцедуры
